// See https://aka.ms/new-console-template for more information
Console.WriteLine("Hello, World!");
// // Архип Чижанов 14/02 20:02
// // Напишите программу, которая выводит случайное число из отрезка [10, 99] и показывает наибольшую цифру числа.
// // 78 -> 8
// // 12-> 2
// // 85 -> 8

// void MaxDecimal (int num)
// {
//     int ed = num % 10;
//     int dec = num / 10;
//     if(ed>dec)
//     {
//         Console.WriteLine($"Большая цифра числа {num} -> {ed}");        // return ed
//     }
//     else    
//     {
//         Console.WriteLine($"Большая цифра числа {num} -> {dec}");        // return dec
//     }
// }

// int num = new Random().Next(10,99+1);

// MaxDecimal (num);

//15-46
